Catalogs/Партнеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>Партнеры</Name>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Перевозчик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮрФизЛицо</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.КомпанияЧастноеЛицо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Конкурент</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрочиеОтношения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбслуживаетсяТорговымиПредставителями</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ПолФизическогоЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойМенеджер</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонЭтикетки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЭтикетокИЦенников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДоступа</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаПартнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БизнесРегион</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗонаДоставки</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗоныДоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтправкиЭлектронногоЧека</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыОтправкиЭлектронногоЧекаПокупателю</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ЭтоПолучательТСР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_СНИЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_СтатусПолучателяТСР</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РСК_СтатусыПолучателяТСР</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ПаллиативнаяПомощь</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РСК_ДокументУЛ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
					<ObjectBelonging>Adopted</ObjectBelonging>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/РСК_ТелефоныДляРассылкиСМС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>РСК_ТелефоныДляРассылкиСМС</Name>
			<Comment>РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/РСК_СтатусыПолучателяТСР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РСК_СтатусыПолучателяТСР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КОбеспечению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Умер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выбыл</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеНайден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Партнеры/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура РСК_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	//++ РС Консалт: Трофимов Евгений 01.11.2022 Задача 21414
	//e1cib/data/Документ.Задание?ref=b3ff9ccd1442090a40674c6b43454ea1
	ОбновитьВидимостьЭлементовПолучателяТСР();
	//-- КонецЗадачи 21414
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 01.11.2022 Задача 21414
//e1cib/data/Документ.Задание?ref=b3ff9ccd1442090a40674c6b43454ea1
&НаСервере
Процедура ОбновитьВидимостьЭлементовПолучателяТСР()

	Элементы.РСК_СНИЛС.Видимость = Объект.РСК_ЭтоПолучательТСР;
	Элементы.РСК_СтатусПолучателяТСР.Видимость = Объект.РСК_ЭтоПолучательТСР;
	Элементы.РСК_ДокументУЛ.Видимость = Объект.РСК_ЭтоПолучательТСР;
	Элементы.РСК_ПаллиативнаяПомощь.Видимость = Объект.РСК_ЭтоПолучательТСР;

КонецПроцедуры // ОбновитьВидимостьЭлементовПолучателяТСР()

//++ РС Консалт: Трофимов Евгений 01.11.2022 Задача 21414
//e1cib/data/Документ.Задание?ref=b3ff9ccd1442090a40674c6b43454ea1
&НаКлиенте
Процедура РСК_РСК_ЭтоПолучательТСРПриИзмененииПосле(Элемент)
	ОбновитьВидимостьЭлементовПолучателяТСР();
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 01.11.2022 Задача 21414
//e1cib/data/Документ.Задание?ref=b3ff9ccd1442090a40674c6b43454ea1
&НаКлиенте
Процедура РСК_РСК_СтатусПолучателяТСРПриИзмененииПосле(Элемент)
	Если Объект.РСК_СтатусПолучателяТСР = ПредопределенноеЗначение("Перечисление.РСК_СтатусыПолучателяТСР.Умер") Тогда
		ПоказатьВопрос(
			Новый ОписаниеОповещения("ПослеВопросаОбАннулированииАктовВыдачиТСР", ЭтаФорма), 
			"Аннулировать подготовленные акты выдачи?",
			РежимДиалогаВопрос.ДаНет
		);
	КонецЕсли;
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 01.11.2022 Задача 21414
//e1cib/data/Документ.Задание?ref=b3ff9ccd1442090a40674c6b43454ea1
&НаКлиенте
Процедура ПослеВопросаОбАннулированииАктовВыдачиТСР(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура("СлужебноеИспользование");
	Парам.Вставить("Партнер", Объект.Ссылка);
	ОткрытьФорму("Обработка.РСК_ОтменаАктовПриСмертиПолучателяТСР.Форма.Форма", Парам, ЭтаФорма);
	
КонецПроцедуры

// Кнопка Телефоны для СМС
//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаКлиенте
Процедура РСК_ТелефоныДляСМСПосле(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПоказатьПредупреждение(,"Сначала нужно записать карточку Партнёра");
		Возврат;
	КонецЕсли;
	
	Парам = Новый Структура;
	Парам.Вставить("АдресТаблицыТелефонов", ПолучитьАдресТаблицыТелефонов());
	Парам.Вставить("Партнер", Объект.Ссылка);
	ОткрытьФорму(
		"Справочник.Партнеры.Форма.РСК_ТелефоныДляСМС",
		Парам,
		ЭтаФорма,,,, 
		Новый ОписаниеОповещения("ПослеУказанияТелефоновДляСМС", ЭтаФорма), 
	);
КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаКлиенте
Процедура ПослеУказанияТелефоновДляСМС(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьФлагиОтправкиСМСдляТелефонов(Результат.АдресТаблицыТелефонов);

КонецПроцедуры

//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаСервере
Процедура УстановитьФлагиОтправкиСМСдляТелефонов(АдресТаблицыТелефонов)

	тзТелефоны = ПолучитьИзВременногоХранилища(АдресТаблицыТелефонов);
	НЗ = РегистрыСведений.РСК_ТелефоныДляРассылкиСМС.СоздатьНаборЗаписей();
	НЗ.Отбор.Партнер.Установить(Объект.Ссылка);
	НЗ.Записать();
	
	Для Каждого Стр Из тзТелефоны Цикл
		Запись = НЗ.Добавить();
		Запись.Партнер = Объект.Ссылка;
		Запись.НомерТелефона = Стр.НомерТелефона;
	КонецЦикла;
	НЗ.Записать();

КонецПроцедуры // УстановитьФлагиОтправкиСМСдляТелефонов()


// Получает адрес временного хранилища таблыцы телефонов
//++ РС Консалт: Трофимов Евгений 05.11.2022 Задача 21666
//e1cib/data/Документ.Задание?ref=9c32d5284cfd59a04da1fbac6171ed0a
&НаСервере
Функция ПолучитьАдресТаблицыТелефонов()

	тзТелефоны = Объект.КонтактнаяИнформация.Выгрузить(
		Новый Структура("Вид", Справочники.ВидыКонтактнойИнформации.ТелефонПартнера),
		"НомерТелефона"
	);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РСК_ТелефоныДляРассылкиСМС.НомерТелефона КАК НомерТелефона
		|ИЗ
		|	РегистрСведений.РСК_ТелефоныДляРассылкиСМС КАК РСК_ТелефоныДляРассылкиСМС
		|ГДЕ
		|	РСК_ТелефоныДляРассылкиСМС.Партнер = &Партнер";
	
	Запрос.УстановитьПараметр("Партнер", Объект.Ссылка);
	тзТелефоны.Колонки.Добавить("ДляСМС", Новый ОписаниеТипов("Булево"));
	
	МассивДляСМС = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("НомерТелефона");
	Для Каждого Стр Из тзТелефоны Цикл
		ИндексМассива = МассивДляСМС.Найти(Стр.НомерТелефона);
		Если ИндексМассива <> Неопределено Тогда
			Стр.ДляСМС = Истина;
			МассивДляСМС.Удалить(ИндексМассива);
		КонецЕсли;
	КонецЦикла;
	Для Каждого НомерТелефона Из МассивДляСМС Цикл
		Стр = тзТелефоны.Добавить();
		Стр.НомерТелефона = НомерТелефона;
		Стр.ДляСМС = Истина;
	КонецЦикла;
	
	Возврат ПоместитьВоВременноеХранилище(тзТелефоны, УникальныйИдентификатор);

КонецФункции // ПолучитьАдресТаблиыТелефонов()
